Дошкольное_учреждение83/src/InformationRegisters/удуШтатноеРасписаниеОрганизаций/удуШтатноеРасписаниеОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуШтатноеРасписаниеОрганизаций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальнаяТарифнаяСтавкаУдалить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяТарифнаяСтавкаУдалить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидТарифнойСтавкиУдалить</name>
    <type>
      <types>EnumRef.удуВидыТарифныхСтавок</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботыУдалить</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>МесячнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НадбавкаПоРайонномуКоэффициенту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.удуОсновныеНачисленияОрганизаций</types>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.удуПодразделенияУчереждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуПлановыеНачисленияРаботниковОрганизаций/удуПлановыеНачисленияРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуПлановыеНачисленияРаботниковОрганизаций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РазмерУдалить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Действие</name>
    <type>
      <types>EnumRef.удуВидыДействияСНачислением</types>
    </type>
  </resources>
  <resources>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.удуДополнительныеНачисленияОрганизаций</types>
      <types>ChartOfCalculationTypesRef.удуОсновныеНачисленияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.удуДоговорНаВыполнениеРаботСФизЛицом</types>
      <types>DocumentRef.удуПриемНаРаботуВОрганизацию</types>
      <types>DocumentRef.удуУвольнениеИзОрганизаций</types>
      <types>DocumentRef.удуКадровоеПеремещениеОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчетаИзмерение</name>
    <type>
      <types>ChartOfCalculationTypesRef.удуДополнительныеНачисленияОрганизаций</types>
      <types>ChartOfCalculationTypesRef.удуОсновныеНачисленияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуРаботникиОрганизаций/удуРаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуРаботникиОрганизаций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.удуПодразделенияУчереждения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.удуПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.удуПриемНаРаботуВОрганизацию</types>
      <types>DocumentRef.удуУвольнениеИзОрганизаций</types>
      <types>DocumentRef.удуКадровоеПеремещениеОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/удуПричиныИзмененияСостояния/удуПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуПричиныИзмененияСостояния</name>
  <enumValues>
    <name>ПриемНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/ChartsOfCalculationTypes/удуОсновныеНачисленияОрганизаций/удуОсновныеНачисленияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>удуОсновныеНачисленияОрганизаций</name>
  <baseCalculationTypes>ChartOfCalculationTypes.удуОсновныеНачисленияОрганизаций</baseCalculationTypes>
  <predefined>
    <items>
      <name>ОплатаБЛПоТравмеВБыту</name>
      <description>БЛ по травме в быту (не оплачивается)</description>
    </items>
    <items>
      <name>ДниНеоплачиваемыеСогласноТабелю</name>
      <description>Дни неоплачиваемые согласно табелю</description>
    </items>
    <items>
      <name>ДоплатаЗаВечерниеЧасы</name>
      <description>Доплата за вечерние часы</description>
    </items>
    <items>
      <name>ДоплатаЗаНочныеЧасы</name>
      <description>Доплата за ночные часы</description>
    </items>
    <items>
      <name>ДоплатаЗаПраздничныеИВыходные</name>
      <description>Доплата за работу в праздники и выходные</description>
    </items>
    <items>
      <name>ДоплатаПоСреднемуБЛ</name>
      <description>Доплата по больничным листам</description>
    </items>
    <items>
      <name>ОтпускБезОплатыУчебный</name>
      <description>Дополнительный учебный отпуск без оплаты</description>
    </items>
    <items>
      <name>ОкладПоДням</name>
      <description>Оклад по дням</description>
    </items>
    <items>
      <name>ОкладПоЧасам</name>
      <description>Оклад по часам</description>
    </items>
    <items>
      <name>ОплатаБЛПоТравмеНаПроизводстве</name>
      <description>Оплата БЛ по травме на производстве</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуБЛ</name>
      <description>Оплата больничных листов</description>
    </items>
    <items>
      <name>ОплатаВыходныхДнейПоУходуЗаДетьмиИнвалидами</name>
      <description>Оплата дополнительных выходных дней по уходу за детьми - инвалидами</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуОтпКалендарныеДни</name>
      <description>Оплата отпуска по календарным дням</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуОтпШестидневка</name>
      <description>Оплата отпуска по шестидневке</description>
    </items>
    <items>
      <name>ТарифДневной</name>
      <description>Оплата по дневному тарифу</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Оплата по производственным нарядам</description>
    </items>
    <items>
      <name>ОплатаПоСреднему</name>
      <description>Оплата по среднему заработку</description>
    </items>
    <items>
      <name>ТарифЧасовой</name>
      <description>Оплата по часовому тарифу</description>
    </items>
    <items>
      <name>ПочасовойПростойОкладПоЧасам</name>
      <description>Оплата почасового простоя от оклада по часам</description>
    </items>
    <items>
      <name>ПочасовойПростойТарифЧасовой</name>
      <description>Оплата почасового простоя по часовому тарифу</description>
    </items>
    <items>
      <name>ОплатаПраздничныхИВыходных</name>
      <description>Оплата праздничных и выходных дней</description>
    </items>
    <items>
      <name>ПростойОкладПоДням</name>
      <description>Оплата простоя от оклада по дням</description>
    </items>
    <items>
      <name>ПростойОкладПоЧасам</name>
      <description>Оплата простоя от оклада по часам</description>
    </items>
    <items>
      <name>ПростойТарифДневной</name>
      <description>Оплата простоя по дневному тарифу</description>
    </items>
    <items>
      <name>ПростойТарифЧасовой</name>
      <description>Оплата простоя по часовому тарифу</description>
    </items>
    <items>
      <name>ОплатаСверхурочных</name>
      <description>Оплата сверхурочных часов</description>
    </items>
    <items>
      <name>ОтпускБезОплатыПоТКРФ</name>
      <description>Отпуск без оплаты согласно ТК РФ</description>
    </items>
    <items>
      <name>ОтпускЗаСвойСчет</name>
      <description>Отпуск за свой счет</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенкомБезОплаты</name>
      <description>Отпуск по уходу за ребенком без оплаты</description>
    </items>
    <items>
      <name>ОтсутствиеПоБолезни</name>
      <description>Отсутствие по болезни</description>
    </items>
    <items>
      <name>ОтсутствиеПоБолезниПоБеременности</name>
      <description>Отсутствие по болезни (по беременности и родам)</description>
    </items>
    <items>
      <name>Невыход</name>
      <description>Отсутствие по невыясненной причине</description>
    </items>
    <items>
      <name>ПособиеПоУходуЗаРебенкомДо1_5Лет</name>
      <description>Пособие по уходу за ребёнком до 1.5 лет</description>
    </items>
    <items>
      <name>ПособиеПоУходуЗаРебенкомДо3Лет</name>
      <description>Пособие по уходу за ребёнком до 3 лет</description>
    </items>
    <items>
      <name>ПочасовойПростойПоВинеРаботодателя</name>
      <description>Почасовой простой по вине работодателя</description>
    </items>
    <items>
      <name>Прогул</name>
      <description>Прогул, простой по вине работника</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>Простой по вине работодателя</description>
    </items>
    <items>
      <name>РайонныйКоэффициент</name>
      <description>Районный коэффициент</description>
    </items>
    <items>
      <name>СевернаяНадбавка</name>
      <description>Северная надбавка</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.удуСпособыРасчетаОплатыТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВремени</name>
    <type>
      <types>EnumRef.удуВидыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеВТабелеУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.удуКлассификаторИспользованияРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажа</name>
    <type>
      <types>CatalogRef.удуВидыСтажа</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЕжегодногоОтпуска</name>
    <type>
      <types>CatalogRef.удуВидыЕжегодныхОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетОтработанногоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.удуПоказателиСхемМотивации</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

Дошкольное_учреждение83/src/InformationRegisters/удуШтатноеРасписаниеОрганизаций/ManagerModule.bsl
// Процедура предназначена для заполнения набора записей штатного расписания по текущему состоянию кадров.
// 
// Параметры:
//	Организация - СправочникСсылка.Организации,организация, для которой заполняется 
//					штатное расписание
//  Период - дата, дата по состоянию на которую осматривается кадровый состав
//
// Возвращаемое значение:
//	нет
//
Процедура Автозаполнение(ЭтотОбъект,Организация, Период, Сообщать = Ложь) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Если Сообщать Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст="Не указана организация!";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Если Сообщать Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст="Не указана дата!";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);

	МассивОтпускПоУходуЗаРебенком = Новый Массив;
	МассивОтпускПоУходуЗаРебенком.Добавить (ПланыВидовРасчета.удуОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты);
	МассивОтпускПоУходуЗаРебенком.Добавить (ПланыВидовРасчета.удуОсновныеНачисленияОрганизаций.ПособиеПоУходуЗаРебенкомДо1_5Лет);
	МассивОтпускПоУходуЗаРебенком.Добавить (ПланыВидовРасчета.удуОсновныеНачисленияОрганизаций.ПособиеПоУходуЗаРебенкомДо3Лет);
	Запрос.УстановитьПараметр("ОтпускПоУходуЗаРебенком", МассивОтпускПоУходуЗаРебенком);
	
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	              |	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник
	              |ПОМЕСТИТЬ СотрудникиПоУходуЗаРебенком
	              |ИЗ
	              |	РегистрСведений.удуПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	              |			&Период,
	              |			Организация = &Организация
	              |				И ВидРасчета В (&ОтпускПоУходуЗаРебенком)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	              |	РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
	              |	СУММА(РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок) КАК КоличествоСтавок,
	              |	&Период КАК Период,
	              |	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	              |	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1 КАК МесячнаяСтавка
	              |ИЗ
	              |	РегистрСведений.удуРаботникиОрганизаций.СрезПоследних(
	              |			&Период,
	              |			Организация = &Организация
	              |				И (НЕ Сотрудник В
	              |						(ВЫБРАТЬ
	              |							СотрудникиПоУходуЗаРебенком.Сотрудник
	              |						ИЗ
	              |							СотрудникиПоУходуЗаРебенком КАК СотрудникиПоУходуЗаРебенком))) КАК РаботникиОрганизацийСрезПоследних
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.удуПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	              |				&Период,
	              |				ВидРасчетаИзмерение.Код ЕСТЬ NULL 
	              |					И Организация = &Организация
	              |					И (НЕ Сотрудник В
	              |							(ВЫБРАТЬ
	              |								СотрудникиПоУходуЗаРебенком.Сотрудник
	              |							ИЗ
	              |								СотрудникиПоУходуЗаРебенком КАК СотрудникиПоУходуЗаРебенком))) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	              |		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник
	              |ГДЕ
	              |	РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.удуПричиныИзмененияСостояния.Увольнение)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	              |	РаботникиОрганизацийСрезПоследних.Должность,
	              |	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	              |	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1";
	
	// Собственно заполняем набор записей.
	ЭтотОбъект.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // Автозаполнение()
